reports/033-node.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 2.013ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.017ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.008ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.11ms    5.16ms  66.11ms   97.17%
    Req/Sec     3.52k   833.67    11.56k    93.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.76ms
 90.000%    2.32ms
 99.000%   34.69ms
 99.900%   55.90ms
 99.990%   64.03ms
 99.999%   65.66ms
100.000%   66.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.059     0.000000            1         1.00
       0.557     0.100000        50090         1.11
       0.749     0.200000       100097         1.25
       0.915     0.300000       149845         1.43
       1.079     0.400000       200055         1.67
       1.252     0.500000       249908         2.00
       1.342     0.550000       274954         2.22
       1.435     0.600000       299724         2.50
       1.536     0.650000       324684         2.86
       1.643     0.700000       349625         3.33
       1.762     0.750000       374697         4.00
       1.827     0.775000       387206         4.44
       1.897     0.800000       399635         5.00
       1.975     0.825000       412014         5.71
       2.065     0.850000       424664         6.67
       2.175     0.875000       437149         8.00
       2.239     0.887500       443254         8.89
       2.315     0.900000       449458        10.00
       2.409     0.912500       455725        11.43
       2.531     0.925000       462011        13.33
       2.719     0.937500       468211        16.00
       2.879     0.943750       471310        17.78
       3.201     0.950000       474425        20.00
       4.127     0.956250       477549        22.86
       5.283     0.962500       480673        26.67
       6.555     0.968750       483787        32.00
       7.323     0.971875       485345        35.56
       8.783     0.975000       486907        40.00
      13.759     0.978125       488469        45.71
      19.023     0.981250       490027        53.33
      24.511     0.984375       491590        64.00
      27.295     0.985938       492374        71.11
      30.175     0.987500       493151        80.00
      33.055     0.989062       493935        91.43
      35.839     0.990625       494709       106.67
      38.655     0.992188       495491       128.00
      40.127     0.992969       495885       142.22
      41.599     0.993750       496276       160.00
      43.007     0.994531       496662       182.86
      44.543     0.995313       497057       213.33
      46.015     0.996094       497443       256.00
      46.751     0.996484       497644       284.44
      47.679     0.996875       497835       320.00
      48.511     0.997266       498032       365.71
      49.535     0.997656       498223       426.67
      50.623     0.998047       498417       512.00
      51.391     0.998242       498520       568.89
      52.191     0.998437       498613       640.00
      53.471     0.998633       498709       731.43
      54.591     0.998828       498805       853.33
      55.999     0.999023       498905      1024.00
      56.799     0.999121       498953      1137.78
      57.599     0.999219       499000      1280.00
      58.303     0.999316       499050      1462.86
      59.263     0.999414       499100      1706.67
      60.063     0.999512       499150      2048.00
      60.351     0.999561       499172      2275.56
      60.895     0.999609       499195      2560.00
      61.503     0.999658       499220      2925.71
      62.015     0.999707       499245      3413.33
      62.367     0.999756       499270      4096.00
      62.623     0.999780       499282      4551.11
      62.943     0.999805       499293      5120.00
      63.263     0.999829       499305      5851.43
      63.615     0.999854       499318      6826.67
      63.839     0.999878       499330      8192.00
      63.999     0.999890       499337      9102.22
      64.159     0.999902       499342     10240.00
      64.223     0.999915       499348     11702.86
      64.383     0.999927       499356     13653.33
      64.575     0.999939       499361     16384.00
      64.639     0.999945       499364     18204.44
      64.735     0.999951       499369     20480.00
      64.735     0.999957       499369     23405.71
      64.767     0.999963       499372     27306.67
      64.895     0.999969       499375     32768.00
      64.991     0.999973       499378     36408.89
      64.991     0.999976       499378     40960.00
      65.087     0.999979       499380     46811.43
      65.119     0.999982       499382     54613.33
      65.215     0.999985       499383     65536.00
      65.535     0.999986       499384     72817.78
      65.535     0.999988       499384     81920.00
      65.663     0.999989       499385     93622.86
      65.727     0.999991       499386    109226.67
      66.047     0.999992       499387    131072.00
      66.047     0.999993       499387    145635.56
      66.047     0.999994       499387    163840.00
      66.111     0.999995       499389    187245.71
      66.111     0.999995       499389    218453.33
      66.111     0.999996       499389    262144.00
      66.111     0.999997       499389    291271.11
      66.111     0.999997       499389    327680.00
      66.111     0.999997       499389    374491.43
      66.111     0.999998       499389    436906.67
      66.175     0.999998       499390    524288.00
      66.175     1.000000       499390          inf
#[Mean    =        2.113, StdDeviation   =        5.163]
#[Max     =       66.112, Total count    =       499390]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599686 requests in 1.00m, 57.76MB read
Requests/sec:   9994.72
Transfer/sec:      0.96MB