reports/033-node.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.946ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.962ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.936ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.23ms    5.91ms  98.94ms   97.25%
    Req/Sec     3.52k   848.60    11.44k    93.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.26ms
 75.000%    1.76ms
 90.000%    2.32ms
 99.000%   37.22ms
 99.900%   70.27ms
 99.990%   95.55ms
 99.999%   97.92ms
100.000%   99.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.560     0.100000        50063         1.11
       0.756     0.200000        99949         1.25
       0.928     0.300000       149944         1.43
       1.093     0.400000       199801         1.67
       1.262     0.500000       249883         2.00
       1.351     0.550000       274755         2.22
       1.444     0.600000       299807         2.50
       1.543     0.650000       324835         2.86
       1.648     0.700000       349645         3.33
       1.764     0.750000       374685         4.00
       1.827     0.775000       387117         4.44
       1.897     0.800000       399523         5.00
       1.975     0.825000       412072         5.71
       2.065     0.850000       424624         6.67
       2.175     0.875000       437139         8.00
       2.241     0.887500       443354         8.89
       2.317     0.900000       449481        10.00
       2.415     0.912500       455764        11.43
       2.543     0.925000       461984        13.33
       2.745     0.937500       468221        16.00
       2.935     0.943750       471327        17.78
       3.461     0.950000       474433        20.00
       4.511     0.956250       477568        22.86
       5.651     0.962500       480676        26.67
       6.963     0.968750       483804        32.00
       7.831     0.971875       485357        35.56
      10.663     0.975000       486917        40.00
      15.879     0.978125       488479        45.71
      21.471     0.981250       490041        53.33
      27.023     0.984375       491600        64.00
      29.951     0.985938       492384        71.11
      32.751     0.987500       493160        80.00
      35.487     0.989062       493942        91.43
      38.335     0.990625       494722       106.67
      41.215     0.992188       495503       128.00
      42.655     0.992969       495898       142.22
      44.095     0.993750       496284       160.00
      45.567     0.994531       496671       182.86
      47.039     0.995313       497064       213.33
      48.543     0.996094       497458       256.00
      49.407     0.996484       497647       284.44
      50.815     0.996875       497844       320.00
      52.479     0.997266       498038       365.71
      55.103     0.997656       498232       426.67
      59.231     0.998047       498427       512.00
      61.151     0.998242       498526       568.89
      63.135     0.998437       498623       640.00
      65.055     0.998633       498721       731.43
      67.071     0.998828       498818       853.33
      71.039     0.999023       498915      1024.00
      73.471     0.999121       498964      1137.78
      76.415     0.999219       499012      1280.00
      78.847     0.999316       499062      1462.86
      81.791     0.999414       499110      1706.67
      84.479     0.999512       499159      2048.00
      86.143     0.999561       499183      2275.56
      87.487     0.999609       499207      2560.00
      89.023     0.999658       499234      2925.71
      90.303     0.999707       499258      3413.33
      91.967     0.999756       499282      4096.00
      92.479     0.999780       499294      4551.11
      93.055     0.999805       499305      5120.00
      93.695     0.999829       499317      5851.43
      94.335     0.999854       499329      6826.67
      95.039     0.999878       499342      8192.00
      95.423     0.999890       499348      9102.22
      95.679     0.999902       499356     10240.00
      95.999     0.999915       499360     11702.86
      96.383     0.999927       499366     13653.33
      96.703     0.999939       499373     16384.00
      96.831     0.999945       499375     18204.44
      97.087     0.999951       499378     20480.00
      97.279     0.999957       499381     23405.71
      97.343     0.999963       499384     27306.67
      97.407     0.999969       499387     32768.00
      97.535     0.999973       499390     36408.89
      97.535     0.999976       499390     40960.00
      97.599     0.999979       499392     46811.43
      97.663     0.999982       499395     54613.33
      97.663     0.999985       499395     65536.00
      97.855     0.999986       499396     72817.78
      97.855     0.999988       499396     81920.00
      97.919     0.999989       499397     93622.86
      98.047     0.999991       499398    109226.67
      98.111     0.999992       499399    131072.00
      98.111     0.999993       499399    145635.56
      98.111     0.999994       499399    163840.00
      98.303     0.999995       499400    187245.71
      98.303     0.999995       499400    218453.33
      98.687     0.999996       499401    262144.00
      98.687     0.999997       499401    291271.11
      98.687     0.999997       499401    327680.00
      98.687     0.999997       499401    374491.43
      98.687     0.999998       499401    436906.67
      99.007     0.999998       499402    524288.00
      99.007     1.000000       499402          inf
#[Mean    =        2.226, StdDeviation   =        5.906]
#[Max     =       98.944, Total count    =       499402]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599695 requests in 1.00m, 57.76MB read
Requests/sec:   9994.72
Transfer/sec:      0.96MB